In [3]:
import pandas

In [4]:
df1=pandas.read_csv('supermarkets.csv')
# df1=df1.set_index('ID') # needs to be set as variable to be persistent
df1.set_index('ID', inplace=True) # this is cool!
df1

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Address</th>
      <th>City</th>
      <th>State</th>
      <th>Country</th>
      <th>Name</th>
      <th>Employees</th>
    </tr>
    <tr>
      <th>ID</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>3666 21st St</td>
      <td>San Francisco</td>
      <td>CA 94114</td>
      <td>USA</td>
      <td>Madeira</td>
      <td>8</td>
    </tr>
    <tr>
      <th>2</th>
      <td>735 Dolores St</td>
      <td>San Francisco</td>
      <td>CA 94119</td>
      <td>USA</td>
      <td>Bready Shop</td>
      <td>15</td>
    </tr>
    <tr>
      <th>3</th>
      <td>332 Hill St</td>
      <td>San Francisco</td>
      <td>California 94114</td>
      <td>USA</td>
      <td>Super River</td>
      <td>25</td>
    </tr>
    <tr>
      <th>4</th>
      <td>3995 23rd St</td>
      <td>San Francisco</td>
      <td>CA 94114</td>
      <td>USA</td>
      <td>Ben's Shop</td>
      <td>10</td>
    </tr>
    <tr>
      <th>5</th>
      <td>1056 Sanchez St</td>
      <td>San Francisco</td>
      <td>California</td>
      <td>USA</td>
      <td>Sanchez</td>
      <td>12</td>
    </tr>
    <tr>
      <th>6</th>
      <td>551 Alvarado St</td>
      <td>San Francisco</td>
      <td>CA 94114</td>
      <td>USA</td>
      <td>Richvalley</td>
      <td>20</td>
    </tr>
  </tbody>
</table>
</div>

In [113]:
####################################
# Label-based indexing, using ranges or single values (will only accept one value)
df1.loc[2:4, 'Name':'Employees']

            Name  Employees
ID
2    Bready Shop         15
3    Super River         25
4     Ben's Shop         10

In [126]:
# all entries for one column, ie all indeces for this label
# we can also convert this to list
list(df1.loc[:, 'Address'])

[' 3666 21st St',
 ' 735 Dolores St',
 ' 332 Hill St',
 ' 3995 23rd St',
 '1056 Sanchez St',
 '551 Alvarado St']

In [120]:
# One row ie complete line by index
df1.loc[4, :]
#####################

Address        3995 23rd St
City          San Francisco
State              CA 94114
Country                 USA
Name             Ben's Shop
Employees                10
Name: 4, dtype: object

In [124]:
# Find a specific cell in the dataframe, ie by index and label
df1.loc[3, 'Name']

' Super River'

In [129]:
####################################
# location-based indexing
# using indeces of rows and columns instead of labels, does the same otherwise
df1

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [133]:
df1.iloc[:, 4:]

            Name  Employees
ID
1        Madeira          8
2    Bready Shop         15
3    Super River         25
4     Ben's Shop         10
5        Sanchez         12
6     Richvalley         20

In [140]:
##### mixed indexing!!! not reconmmended as its less clear
df1.ix[4,'City':'State']

City      San Francisco
State          CA 94114
Name: 4, dtype: object

In [144]:
df1.ix[4, 1:3]

City      San Francisco
State          CA 94114
Name: 4, dtype: object